Autodesk.Revit.DB.FailureHandlingOptions.GetFailuresPreprocessor
Gets the callback to be invoked in the beginning of failure processing.
Returns:
The callback to be invoked in the beginning of failure processing.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetTransactionFinalizer
Gets the callback to be executed after transaction is completed.
Returns:
The callback to be executed after transaction is completed.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetDelayedMiniWarnings
Obtains the flag indicating if showing of mini-warning dialog should be delayed until the end of next transaction.
Returns:
True to delay the display of the mini-warning dialog until the end of the next transation, false to display them as this transaction is completed.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetClearAfterRollback
Obtains the flag indicating if all posted failures should be removed silently when transaction is being rolled back.
Returns:
True to clear posted failures silently if the transaction is being rolled back, false to keep these failures in place (they may be displayed to the user).
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetForcedModalHandling
Obtains the flag indicating if the error handling dialog shown at the end of the failing transaction should be modal.
Returns:
True if the options force Revit to use a modal error dialog, false if it allows use of a non-blocking dialog for warnings resulting from this transaction.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetFailuresPreprocessor(Autodesk.Revit.DB.IFailuresPreprocessor)
Sets the callback to be invoked in the beginning of failure processing.
preprocessor:
The callback to be invoked in the beginning of failure processing.
Returns:
This FailureHandlingOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetTransactionFinalizer(Autodesk.Revit.DB.ITransactionFinalizer)
Sets the callback to be executed after the transaction is completed.
finalizer:
The callback to be executed after the transaction is completed.
Returns:
This FailureHandlingOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetDelayedMiniWarnings(System.Boolean)
Sets a flag indicating if Revit should delay the display of the mini-warning dialog (if one is to be shown as a result of warnings in the current transaction)
until the end of the next transaction.
Remarks:
This controls warnings suitable for the mini-warnings dialog only.  If the modal flag is set to true
with Autodesk.Revit.DB.FailureHandlingOptions.SetForcedModalHandling(System.Boolean) then this flag will be ignored.
bFlag:
True to delay the display of the mini-warning dialog until the end of the next transation, false to display them as this transaction is completed.
Returns:
This FailureHandlingOptions object.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetClearAfterRollback(System.Boolean)
Sets a flag indicating that Revit should clear all posted failures silently when the failing transaction is being rolled back intentionally.  If
not set, the failures may still be displayed to the user during rollback.
bFlag:
True to clear posted failures silently if the transaction is being rolled back, false to keep these failures in place (they may be displayed to the user).
Returns:
This FailureHandlingOptions object.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetForcedModalHandling(System.Boolean)
Sets a flag indicating whether Revit will show a modal (blocking) error dialog if the transaction failed to finish.
bFlag:
True to force Revit to use a modal error dialog, false to allow a non-blocking dialog for warnings resulting from this transaction.
Returns:
This FailureHandlingOptions object.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureHandlingOptions
Options to control how failures (if any occurred during the transaction)
should be handled at the time the transaction is being ended.
Since:
2011